# DBeam_SetFocusPoint

## Description
Set focus point for the beam

```pascal
PROCEDURE DBeam_SetFocusPoint(pt : REAL);
```

```python

def vs.DBeam_SetFocusPoint(pt):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|pt|REAL||

## Version
Availability: from Vectorworks 2011
## Category
* Spotlight